commands_templates/UploadCertificate0.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsdl="http://www.onvif.org/ver10/advancedsecurity/wsdl">
   <soap:Header/>
   <soap:Body>
      <wsdl:UploadCertificate>
         <!--type: Base64DERencodedASN1Value-->
         <wsdl:Certificate>cid:1320488054133</wsdl:Certificate>
         <!--Optional:-->
         <!--type: string-->
         <wsdl:Alias>?</wsdl:Alias>
         <!--Optional:-->
         <!--type: string-->
         <wsdl:KeyAlias>?</wsdl:KeyAlias>
         <!--Optional:-->
         <!--type: boolean-->
         <wsdl:PrivateKeyRequired>false</wsdl:PrivateKeyRequired>
      </wsdl:UploadCertificate>
   </soap:Body>
</soap:Envelope>